image/notebooks/experimental/par_foam_ccx/fluid/0/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 0 2 -3 0 0 0 0 ];

internalField   uniform 0.01;

boundaryField
{
    interface
    {
        type            epsilonWallFunction;
        value           uniform 0.01;
    }
    inlet
    {
        type            epsilonWallFunction;
        value           uniform 0.01;
    }
    outlet
    {
        type            epsilonWallFunction;
        value           uniform 0.01;
    }
    non_interface_walls
    {
        type            epsilonWallFunction;
        value           uniform 0.01;
    }
    symm_parts3
    {
        type            symmetryPlane;
    }
    symm_parts4
    {
        type            epsilonWallFunction;
        value           uniform 0.01;
    }
    defaultFaces
    {
        type            empty;
    }
}


// ************************************************************************* //
