image/notebooks/experimental/par_foam_ccx/fluid/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

7
(
    inlet
    {
        type            patch;
        nFaces          161;
        startFace       65002;
    }
    outlet
    {
        type            patch;
        nFaces          161;
        startFace       65163;
    }
    non_interface_walls
    {
        type            wall;
        inGroups        1(wall);
        nFaces          203;
        startFace       65324;
    }
    interface
    {
        type            wall;
        inGroups        1(wall);
        nFaces          161;
        startFace       65527;
    }
    symm_parts3
    {
        type            symmetryPlane;
        inGroups        1(symmetryPlane);
        nFaces          21;
        startFace       65688;
    }
    symm_parts4
    {
        type            wall;
        inGroups        1(wall);
        nFaces          21;
        startFace       65709;
    }
    defaultFaces
    {
        type            empty;
        inGroups        1(empty);
        nFaces          65366;
        startFace       65730;
    }
)

// ************************************************************************* //
